[
    {
        "id": "6249e783bdd0c6670ae47cc3",
        "picture": "http://placehold.it/32x32",
        "name": "Misty Stephens",
        "review": "This was my first time buying a watch from whiteshopping.com and I could not be happier! I was a little skeptical at first buying an expensive watch online but figured I’d give it a chance. The watch I ordered came in perfect condition and the shipping was fast six days. The customer service was amazing! Thank you!",
        "rating": "4.5 star"
    },
    {
        "id": "6249e7831809ef68f0fc77f1",
        "picture": "http://placehold.it/32x32",
        "name": "Brady Jefferson",
        "review": "So I have seen a few negative reviews on here about them, but I also have a friend who has bought a couple of watches, so I thought i'd try them. They had the Omega that I was looking for at a competitive price. They were super friendly on the phone. I got it brand new AND with all 3 Omega cards. So as ordered. Now they do take a while to ship, but be a little patient. Great place. Will buy again.",
        "rating": "4 star"
    },
    {
        "id": "6249e783f9a97fe32e0cde43",
        "picture": "http://placehold.it/32x32",
        "name": "Ortega Franco",
        "review": " In my experience with WatchShopping.com, I feel I have to voice how great my purchase went. I do live in CA, so shipping was lightning fast. I read a few negative reviews here, but, I strongly disagree with the bad outcome some have reported. I’m very pleased with the quality and care I received. I bought the Omega SeaMaster Professional Diver 300M at a fantastic price of $4,700 out-the-door. The package arrived well protected with great cushioning. When I opened the brand new box, I was overjoyed to see a perfect condition, straight-from-the-factory timepiece. It had all the warranty cards, certificates and operating manual AND had all the protective films in tact attached to the sapphire crystals. WOW! I’m so impressed, I will absolutely purchase from WatchShopping.com again. Bravo!",
        "rating": "5 star"
    },
    {
        "id": "6249e783ac2abfe2c0f508bc",
        "picture": "http://placehold.it/32x32",
        "name": "Craft Wagner",
        "review": "Best watch i ever owned in my entire life came from this business her. All gold michael kors fashion watch. Nice price. It’s just the shipping that had took forever. Even tho i paid for 2 day shipping. Took a week. So don’t pay the extra money. Choose regular shipping. Samething",
        "rating": "3 star"
    },
    {
        "id": "6249e7831ee17a27bee7d2a5",
        "picture": "http://placehold.it/32x32",
        "name": "Adrienne Goff",
        "review": "Just wanted to take this moment to make a review on my personal experience with WatchShopping and all the team, but most importantly my experience with Manager AL, he was absolutely amazing!!! And deserves all the recognition. I had a issue that Al resolved for me, he’s extremely understanding, kind, professional and hard working and committed. I want to thank you again to the great team you have. I will for sure make future purchases and will recommend this company to all my friend.",
        "rating": "3.5 star"
    },
    {
        "id": "6249e783169e2cf9a4bd6885",
        "picture": "http://placehold.it/32x32",
        "name": "Steele Poole",
        "review": "Hi, I have ordered one MK watch more than a week ago but didn't receive any tracking details nor any updates regarding where is the package. Unable to understand what should i do..",
        "rating": "1 star"
    }
]